{
  "pageHeader": "Projects and Demos",
  "projects": [

    {
      "name": "Simulating Particle Flocking",
      "course": "Physically-Based Modeling",
      "level": "Graduate",
      "description": "Demo of physically-based simulation of flocking particles. The simulation, from maintaining state vectors to step-approximation, was done myself. We were given leeway on how to demonstrate flocking, so I used TIE Fighters instead of birds.",
      "technologies": "Physically based simulation hand-coded in Javascript; 3D with Three.js.",
      "role": "",
      "image": "/images/flocking.png",
      "demo": {
          "requires": "Runs best in Google Chrome for Desktop. Textures do not load in Safari.",
          "link": "/flockingDemo"
        }
    },
    {
      "name": "ideaMACHE ",
      "description": "IdeaMâché is a browser-based expressive web curation system that uses information composition as the medium of curation. Curation is the process of assembling information in meaningful exhibits, for people to think about. IdeaMâché allows users to collect, arrange, annotate and synthesize digital content to express relationships and develop ideas.",
      "technologies": "JS. REST. Chrome Extension",
      "team": "Implemented bibliography generation (works best for papers from the ACM DL). Interviewed users for research projects. Assorted debugging and maintenance work over the years.",
      "image": "/images/ideamacheLogo.png",
      "demo": {
          "requires": "Requires Chrome. Will prompt you to install the IdeaMACHE extension, which allows ideaMACHE to generate metadata for curated elemets.",
          "link": "https://ideamache.ecologylab.net/"
        }
    },

    {
      "name": "KidGab Moderation",
      "course": "Capstone Project",
      "level": "Undergraduate",
      "description": "We implemented and did a formative evaluation of two moderation systems for KidGab, a social media platform for children: (1) Tools for reporting and moderating comments; (2) Machine learning model for automatically flaging comments for review. The KidGab project was created by Stephanie Valentine",
      "technologies": "JS, WordPress Plugings, Weka",
      "team": "Team leader - coordinated group activities and communication in addition to programming repsonsibilities."
    },
    {
      "name": "Makeup Palette Builder",
      "level": "",
      "description": "tbd",
      "technologies": "Like, prolly react but who knows",
      "role": "Solo",
      "image": "",
      "demoLink": ""
    }

  ]
}
